pitzDaily/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

laminar
{
	model           generalisedNewtonian;
	// Check the shiftedPowerLaw from Tutorial 1
	viscosityModel  powerLaw; 
	k 		0.001;
	n 		0.9;   
	nuMin   	0.000001;
	nuMax   	0.001;
	shiftFactor   	5;
}

// ************************************************************************* //
